garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F05Q40.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RA5PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RA5PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x206">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA5PPS0" edc:mask="0x1" edc:name="RA5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA5PPS1" edc:mask="0x1" edc:name="RA5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA5PPS2" edc:mask="0x1" edc:name="RA5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA5PPS3" edc:mask="0x1" edc:name="RA5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA5PPS4" edc:mask="0x1" edc:name="RA5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA5PPS5" edc:mask="0x1" edc:name="RA5PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x207"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x208"/>
        <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x209"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RC0PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RC0PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x211">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC0PPS0" edc:mask="0x1" edc:name="RC0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC0PPS1" edc:mask="0x1" edc:name="RC0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC0PPS2" edc:mask="0x1" edc:name="RC0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC0PPS3" edc:mask="0x1" edc:name="RC0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC0PPS4" edc:mask="0x1" edc:name="RC0PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC0PPS5" edc:mask="0x1" edc:name="RC0PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RC1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RC1PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x212">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC1PPS0" edc:mask="0x1" edc:name="RC1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC1PPS1" edc:mask="0x1" edc:name="RC1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC1PPS2" edc:mask="0x1" edc:name="RC1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC1PPS3" edc:mask="0x1" edc:name="RC1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC1PPS4" edc:mask="0x1" edc:name="RC1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC1PPS5" edc:mask="0x1" edc:name="RC1PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RC2PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RC2PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x213">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC2PPS0" edc:mask="0x1" edc:name="RC2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC2PPS1" edc:mask="0x1" edc:name="RC2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC2PPS2" edc:mask="0x1" edc:name="RC2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC2PPS3" edc:mask="0x1" edc:name="RC2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC2PPS4" edc:mask="0x1" edc:name="RC2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC2PPS5" edc:mask="0x1" edc:name="RC2PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RC3PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RC3PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x214">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC3PPS0" edc:mask="0x1" edc:name="RC3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC3PPS1" edc:mask="0x1" edc:name="RC3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC3PPS2" edc:mask="0x1" edc:name="RC3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC3PPS3" edc:mask="0x1" edc:name="RC3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC3PPS4" edc:mask="0x1" edc:name="RC3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC3PPS5" edc:mask="0x1" edc:name="RC3PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
