garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F05Q40.PIC
        <edc:SFRDef edc:access="nnnnnrrr" edc:cname="IPR3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IPR3" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q41_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x36A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI1RXIP" edc:mask="0x1" edc:name="SPI1RXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1TXIP" edc:mask="0x1" edc:name="SPI1TXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1IP" edc:mask="0x1" edc:name="SPI1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR2IP" edc:mask="0x1" edc:name="TMR2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1IP" edc:mask="0x1" edc:name="TMR1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1GIP" edc:mask="0x1" edc:name="TMR1GIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1IP" edc:mask="0x1" edc:name="CCP1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0IP" edc:mask="0x1" edc:name="TMR0IP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnnnrrrr" edc:cname="IPR4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IPR4" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q41_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x36B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U1RXIP" edc:mask="0x1" edc:name="U1RXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1TXIP" edc:mask="0x1" edc:name="U1TXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1EIP" edc:mask="0x1" edc:name="U1EIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1IP" edc:mask="0x1" edc:name="U1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3IP" edc:mask="0x1" edc:name="TMR3IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3GIP" edc:mask="0x1" edc:name="TMR3GIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1PIP" edc:mask="0x1" edc:name="PWM1PIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1IP" edc:mask="0x1" edc:name="PWM1IP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnnn-rrr" edc:cname="IPR5" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="IPR5" edc:nzwidth="8" edc:por="0000-000" edc:_modsrc="DOS-xxxx_Interrupts_Q41_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x36C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI2RXIP" edc:mask="0x1" edc:name="SPI2RXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2TXIP" edc:mask="0x1" edc:name="SPI2TXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2IP" edc:mask="0x1" edc:name="SPI2IP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C2IP" edc:mask="0x1" edc:name="C2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC2IP" edc:mask="0x1" edc:name="CLC2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2PIP" edc:mask="0x1" edc:name="PWM2PIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2IP" edc:mask="0x1" edc:name="PWM2IP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="CM2IP" edc:mask="0x1" edc:name="CM2IP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnn-n" edc:cname="IPR6" edc:desc="" edc:impl="0xfd" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000-0" edc:name="IPR6" edc:nzwidth="8" edc:por="000000-0" edc:_modsrc="DOS-xxxx_Interrupts_Q41_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x36D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT1IP" edc:mask="0x1" edc:name="INT1IP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CWG1IP" edc:mask="0x1" edc:name="CWG1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO1IP" edc:mask="0x1" edc:name="NCO1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2SCNTIP" edc:mask="0x1" edc:name="DMA2SCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2DCNTIP" edc:mask="0x1" edc:name="DMA2DCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2ORIP" edc:mask="0x1" edc:name="DMA2ORIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2AIP" edc:mask="0x1" edc:name="DMA2AIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnn-rrrr" edc:cname="IPR7" edc:desc="" edc:impl="0xef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-0000" edc:name="IPR7" edc:nzwidth="8" edc:por="000-0000" edc:_modsrc="DOS-xxxx_Interrupts_Q41_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x36E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="I2C1RXIP" edc:mask="0x1" edc:name="I2C1RXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1TXIP" edc:mask="0x1" edc:name="I2C1TXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1IP" edc:mask="0x1" edc:name="I2C1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1EIP" edc:mask="0x1" edc:name="I2C1EIP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLC3IP" edc:mask="0x1" edc:name="CLC3IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3PIP" edc:mask="0x1" edc:name="PWM3PIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3IP" edc:mask="0x1" edc:name="PWM3IP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
