garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F05Q40.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3ERS" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM3ERS" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x47E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ERS" edc:mask="0xff" edc:name="ERS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ERS0" edc:mask="0x1" edc:name="ERS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS1" edc:mask="0x1" edc:name="ERS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS2" edc:mask="0x1" edc:name="ERS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS3" edc:mask="0x1" edc:name="ERS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS4" edc:mask="0x1" edc:name="ERS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS5" edc:mask="0x1" edc:name="ERS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS6" edc:mask="0x1" edc:name="ERS6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS7" edc:mask="0x1" edc:name="ERS7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3CLK" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM3CLK" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x47F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLK" edc:mask="0xff" edc:name="CLK" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLK0" edc:mask="0x1" edc:name="CLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK1" edc:mask="0x1" edc:name="CLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK2" edc:mask="0x1" edc:name="CLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK3" edc:mask="0x1" edc:name="CLK3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK4" edc:mask="0x1" edc:name="CLK4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK5" edc:mask="0x1" edc:name="CLK5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK6" edc:mask="0x1" edc:name="CLK6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK7" edc:mask="0x1" edc:name="CLK7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3LDS" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM3LDS" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x480">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LDS" edc:mask="0xff" edc:name="LDS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LDS0" edc:mask="0x1" edc:name="LDS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LDS1" edc:mask="0x1" edc:name="LDS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LDS2" edc:mask="0x1" edc:name="LDS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LDS3" edc:mask="0x1" edc:name="LDS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LDS4" edc:mask="0x1" edc:name="LDS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LDS5" edc:mask="0x1" edc:name="LDS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LDS6" edc:mask="0x1" edc:name="LDS6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LDS7" edc:mask="0x1" edc:name="LDS7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="PWM3PR" edc:desc="" edc:name="PWM3PR" edc:nzwidth="0x10" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x481">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3PRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM3PRL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x481">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRL" edc:mask="0xff" edc:name="PRL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3PRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM3PRH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x482">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRH" edc:mask="0xff" edc:name="PRH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3CPRE" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM3CPRE" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x483">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CPRE" edc:mask="0xff" edc:name="CPRE" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3PIPOS" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM3PIPOS" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x484">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIPOS" edc:mask="0xff" edc:name="PIPOS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nn" edc:cname="PWM3GIR" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="PWM3GIR" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x485">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S1P1IF" edc:mask="0x1" edc:name="S1P1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S1P2IF" edc:mask="0x1" edc:name="S1P2IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nn" edc:cname="PWM3GIE" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="PWM3GIE" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x486">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S1P1IE" edc:mask="0x1" edc:name="S1P1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S1P2IE" edc:mask="0x1" edc:name="S1P2IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n----nnn" edc:cname="PWM3CON" edc:desc="" edc:impl="0x87" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0----000" edc:name="PWM3CON" edc:nzwidth="8" edc:por="0----000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x487">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ERSNOW" edc:mask="0x1" edc:name="ERSNOW" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERSPOL" edc:mask="0x1" edc:name="ERSPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LD" edc:mask="0x1" edc:name="LD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="EN" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn--nnnn" edc:cname="PWM3S1CFG" edc:desc="" edc:impl="0xcf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000" edc:name="PWM3S1CFG" edc:nzwidth="8" edc:por="00--0000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x488">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:mask="0x7" edc:name="MODE" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PPEN" edc:mask="0x1" edc:name="PPEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="POL1" edc:mask="0x1" edc:name="POL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POL2" edc:mask="0x1" edc:name="POL2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="MODE0" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="PWM3S1P1" edc:desc="" edc:name="PWM3S1P1" edc:nzwidth="0x10" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x489">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3S1P1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM3S1P1L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x489">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="S1P1L" edc:mask="0xff" edc:name="S1P1L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3S1P1H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM3S1P1H" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x48A">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="S1P1H" edc:mask="0xff" edc:name="S1P1H" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
