garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F05Q40.PIC
        <edc:JoinedSFRDef edc:cname="PWM3S1P2" edc:desc="" edc:name="PWM3S1P2" edc:nzwidth="0x10" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x48B">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3S1P2L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM3S1P2L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x48B">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="S1P2L" edc:mask="0xff" edc:name="S1P2L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3S1P2H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM3S1P2H" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x48C">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="S1P2H" edc:mask="0xff" edc:name="S1P2H" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:AdjustPoint edc:offset="0xF" edc:_addr="0x48D"/>
        <edc:SFRDef edc:access="-----nnn" edc:cname="PWMLOAD" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PWMLOAD" edc:nzwidth="8" edc:por="-----000" edc:_addr="0x49C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MPWM1LD" edc:mask="0x1" edc:name="MPWM1LD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MPWM2LD" edc:mask="0x1" edc:name="MPWM2LD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MPWM3LD" edc:mask="0x1" edc:name="MPWM3LD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="PWMEN" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PWMEN" edc:nzwidth="8" edc:por="-----000" edc:_addr="0x49D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MPWM1EN" edc:mask="0x1" edc:name="MPWM1EN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MPWM2EN" edc:mask="0x1" edc:name="MPWM2EN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MPWM3EN" edc:mask="0x1" edc:name="MPWM3EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0xA" edc:_addr="0x49E"/>
        <edc:SFRDef edc:access="rnnnnrnn" edc:cname="PIE0" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIE0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q41_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4A8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SWIE" edc:mask="0x1" edc:name="SWIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDIE" edc:mask="0x1" edc:name="HLVDIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSFIE" edc:mask="0x1" edc:name="OSFIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSWIE" edc:mask="0x1" edc:name="CSWIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NVMIE" edc:mask="0x1" edc:name="NVMIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC1IE" edc:mask="0x1" edc:name="CLC1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRCIE" edc:mask="0x1" edc:name="CRCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCIE" edc:mask="0x1" edc:name="IOCIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIE1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIE1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q41_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4A9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT0IE" edc:mask="0x1" edc:name="INT0IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ZCDIE" edc:mask="0x1" edc:name="ZCDIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADIE" edc:mask="0x1" edc:name="ADIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTIE" edc:mask="0x1" edc:name="ACTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1IE" edc:mask="0x1" edc:name="C1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMT1IE" edc:mask="0x1" edc:name="SMT1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMT1PRAIE" edc:mask="0x1" edc:name="SMT1PRAIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMT1PWAIE" edc:mask="0x1" edc:name="SMT1PWAIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="CM1IE" edc:mask="0x1" edc:name="CM1IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn---n" edc:cname="PIE2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000---0" edc:name="PIE2" edc:nzwidth="8" edc:por="0000---0" edc:_modsrc="DOS-xxxx_Interrupts_Q41_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4AA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADTIE" edc:mask="0x1" edc:name="ADTIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="DMA1SCNTIE" edc:mask="0x1" edc:name="DMA1SCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1DCNTIE" edc:mask="0x1" edc:name="DMA1DCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1ORIE" edc:mask="0x1" edc:name="DMA1ORIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1AIE" edc:mask="0x1" edc:name="DMA1AIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnrrr" edc:cname="PIE3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIE3" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q41_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4AB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI1RXIE" edc:mask="0x1" edc:name="SPI1RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1TXIE" edc:mask="0x1" edc:name="SPI1TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1IE" edc:mask="0x1" edc:name="SPI1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR2IE" edc:mask="0x1" edc:name="TMR2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1IE" edc:mask="0x1" edc:name="TMR1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1GIE" edc:mask="0x1" edc:name="TMR1GIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1IE" edc:mask="0x1" edc:name="CCP1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0IE" edc:mask="0x1" edc:name="TMR0IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnnnrrrr" edc:cname="PIE4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIE4" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q41_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4AC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U1RXIE" edc:mask="0x1" edc:name="U1RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1TXIE" edc:mask="0x1" edc:name="U1TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1EIE" edc:mask="0x1" edc:name="U1EIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1IE" edc:mask="0x1" edc:name="U1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3IE" edc:mask="0x1" edc:name="TMR3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3GIE" edc:mask="0x1" edc:name="TMR3GIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1PIE" edc:mask="0x1" edc:name="PWM1PIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1IE" edc:mask="0x1" edc:name="PWM1IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnnn-rrr" edc:cname="PIE5" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="PIE5" edc:nzwidth="8" edc:por="0000-000" edc:_modsrc="DOS-xxxx_Interrupts_Q41_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4AD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI2RXIE" edc:mask="0x1" edc:name="SPI2RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2TXIE" edc:mask="0x1" edc:name="SPI2TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2IE" edc:mask="0x1" edc:name="SPI2IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C2IE" edc:mask="0x1" edc:name="C2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC2IE" edc:mask="0x1" edc:name="CLC2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2PIE" edc:mask="0x1" edc:name="PWM2PIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2IE" edc:mask="0x1" edc:name="PWM2IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="CM2IE" edc:mask="0x1" edc:name="CM2IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnn-n" edc:cname="PIE6" edc:desc="" edc:impl="0xfd" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000-0" edc:name="PIE6" edc:nzwidth="8" edc:por="000000-0" edc:_modsrc="DOS-xxxx_Interrupts_Q41_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4AE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT1IE" edc:mask="0x1" edc:name="INT1IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CWG1IE" edc:mask="0x1" edc:name="CWG1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO1IE" edc:mask="0x1" edc:name="NCO1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2SCNTIE" edc:mask="0x1" edc:name="DMA2SCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2DCNTIE" edc:mask="0x1" edc:name="DMA2DCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2ORIE" edc:mask="0x1" edc:name="DMA2ORIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2AIE" edc:mask="0x1" edc:name="DMA2AIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
